#### GetFabricationConnectorInfo Method

---

|  |
| --- |
| Connector Class   See Also |

Gets fabrication connectivity information.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public FabricationConnectorInfo GetFabricationConnectorInfo() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetFabricationConnectorInfo As FabricationConnectorInfo ``` |

| Visual C++ |
| --- |
| ``` public: FabricationConnectorInfo^ GetFabricationConnectorInfo() ``` |

#### Return Value

Returns    a null reference (  Nothing  in Visual Basic)  if there is no fabrication connector information associated.

# See Also

Connector Class

Autodesk.Revit.DB Namespace